extends Node2D
class_name BossInfo
@onready var title: Label = $MarginContainer/TextList/Title
@onready var text_list: VBoxContainer = $MarginContainer/TextList

var MonsterName: String

var MonsterSkillInfoList = {
	"mhw":{"MonsterName": "猕猴王","SkillList":[
			"1.通风回旋：快速旋转通风棍，短暂引导后扔出两个通风灵轮，对命中的玩家造成伤害和巨额减速，灵轮的速度会逐渐提升。",
			"2.飓风狂袭：自身快速旋转，引发沙尘暴，将玩家卷入其中，造成伤害。"]},
	"yrw":{"MonsterName": "禺狨王","SkillList":[
			"1.电闪：禺狨王挥舞权杖，在身前召唤一道闪电，对命中的玩家造成减速效果。",
			"2.预言之雷：默念口诀，自身无法被命中，然后在最初引导时玩家所处位置召唤预言之雷，造成大量伤害。"]},
	"bfsx":{"MonsterName": "蝙蝠石像","SkillList":[
			"1.护体石肤：蝙蝠石像被动获得巨额双抗。",
			"2.暗夜召唤：蝙蝠石像在自身周围召唤数只蝙蝠。"]},
	"stw":{"MonsterName": "狮驼王","SkillList":[
			"1.傀儡毒雾：短暂引导（可被打断）后，在自身前方召唤持续数秒的毒雾，对进入毒雾范围内的敌人施加一层毒，每秒扣除一定量的生命。",
			"2.移山岩爆：狮驼王将大刀插入地面，在自身附近接连引发三次岩爆，造成巨额伤害并眩晕目标。"]},
	"pmw":{"MonsterName": "鹏魔王","SkillList":[
			"1.不死火鸟（被动）：鹏魔王每隔一段时间从空中单位和地面单位相互切换，生命低于20%化为凤凰蛋，双抗大幅提升，同时在周围召唤护体神火攻击玩家，若
			一定时间内未击杀蛋，则鹏魔王满血复活并提升生命。",
			"2.涅槃之火（地面）：鹏魔王将月戟掷向空中，短暂延迟后召唤三道涅槃之火，对命中的敌人造成伤害并施加灼烧。",
			"3.涅槃之火（飞行）：鹏魔王将月戟掷向地面，短暂延迟后召唤三道涅槃之火，对命中的敌人造成伤害并施加灼烧。",
			"4.火鸟俯冲（飞行）：鹏魔王化身火鸟，从高处向地面发起四次俯冲，造成大量伤害，并且对命中的玩家施加灼烧。"]},
	"gcx":{"MonsterName": "龟丞相","SkillList":[
			"1.寒冰波：龟丞相挥舞双臂，召唤一个寒冰波向前方飞行，对命中的玩家施加冰冻效果。",
			"2.水龙卷：龟丞相缩进龟壳，然后快速旋转，引发水龙卷并向前快速冲击，造成多次伤害，冲刺结束后自身进入一段时间的眩晕。"]},
	"jmw":{"MonsterName": "蛟魔王","SkillList":[
			"1.绝对防御（被动）：造成伤害时，若与蛟魔王朝向相同，则伤害转为对蛟魔王的治疗效果。",
			"2.覆海蛟龙：蛟魔王怒吼，召唤覆海蛟龙，对玩家造成伤害并震晕玩家。",
			"3.堕天神针：蛟魔王召唤数支神针落向地面，对命中的玩家造成大量伤害并施加减速。"]},
	"sy":{"MonsterName": "嗜血狂鲨","SkillList":[
			"1.鲨龙卷：嗜血狂鲨快速抖动，短暂延迟后爆炸，造成伤害，之后在玩家位置召唤一个鲨龙卷。",
			"2.鲨鱼突袭：嗜血狂鲨快速镶嵌冲刺，同时进行撕咬，对玩家造成多次伤害"]},
	"smw":{"MonsterName": "鲨魔王","SkillList":[
			"1.鲨鱼刀的庇佑（被动）：鲨魔王生命低于70%时会召唤嗜血狂鲨参与战斗，同时改变自身形态，自身的部分技能命中玩家时会恢复生命（生命越低，恢复能力越强）。",
			"2.嗜血鲨鱼刀：鲨魔王举起鲨鱼刀砍向前方，对大范围内的玩家造成伤害。",
			"3.嗜血鲨鱼波：鲨魔王召唤鲨鱼波，然后鲨鱼从中间向两侧冲刺，对玩家造成伤害并施加流血。",
			"4.鲨鱼玄波：鲨魔王在玩家位置召唤一个鲨鱼泡，短暂延迟后破裂，震晕命中的玩家。"]},
	"nmw1":{"MonsterName": "牛魔王·兽","SkillList":[
			"1.牛魔王为青牛形态，只会向两侧冲锋，冲锋时在自身位置召唤地狱火柱。",]},
	"nmw2":{"MonsterName": "牛魔王·人","SkillList":[
			"1.万魂煞：牛魔王激发身体内的邪恶力量，对周围玩家造成多次打击，若未被打断，则多次恢复自身生命，并且每次都会提升自身所有伤害。",
			"2.蛮牛冲撞：牛魔王化身为青牛形态，快速向前冲刺。",
			"3.岩石机甲：牛魔王化身为岩石机甲，不断地砸向地面，对附近的玩家造成多次伤害。",]},
	"nmw3":{"MonsterName": "牛魔王·鬼","SkillList":[
			"1.万魂之体（被动）：牛魔王不受控制技能的影响，并且只有击中本体才能造成有效伤害。",
			"2.鬼手：牛魔王的两只鬼手会随机追踪玩家并砸向地面，造成大量伤害。",
			"3.地狱烈焰：牛魔王召唤地狱烈焰：五种形态：1.从左至右，2.从右至左，3.间隔，4.交叉间隔，5.随机",]},
}
func _physics_process(delta: float) -> void:
	ADDInfo()
	set_physics_process(false)
func ADDInfo():
	if MonsterSkillInfoList.has(MonsterName):
		title.text = MonsterSkillInfoList[MonsterName]["MonsterName"] + str("Boss")
		for i in MonsterSkillInfoList[MonsterName]["SkillList"]:
			Global.ADDFont_(text_list,i,"res://Font/华康宋体W3.ttc",17,"FFFFFF",1,"FFFFFF")
	else:
		queue_free()

