extends Node2D
@onready var monster_info: VBoxContainer = $BG/ColorRect/MonsterInfo/ScrollContainer/MonsterInfo

var MonsterName: String:
	set(vl):
		MonsterName = vl
		RefreshInfo()
var MonsterSkillInfoList: Dictionary = {
	"dxx":[
		"主动技能：",
		"1.挥拳：挥出强力一拳，对玩家造成伤害。"
	],
	"mhw":[
		"主动技能：",
		"1.通风旋刃：快速旋转通风灵棍，短暂蓄力后，扔出两次，对命中的玩家造成伤害并施加【减速】。",
		"2.飓风狂袭：自身快速旋转，引发强烈龙卷风，对敌人造成多次伤害。"
	],
	"yrw":[
		"主动技能：",
		"1.天罚：挥舞权杖，在前方引发雷击，造成伤害并麻痹敌人（施加【减速】）。",
		"2.预言之雷：默念咒语，之后指向天空，在玩家头顶召唤预言之雷，造成多次打击（位置为禺狨王默念口诀瞬间，玩家位置）。"
	],
	"bfsx":[
		"被动技能：",
		"护体石肤：蝙蝠石像的双抗大幅提升，只有找到方式才可以破除防御，护体石肤期间，蝙蝠石像会持续恢复一定量的生命。",
		"主动技能：",
		"召唤：每过一段时间，召唤数量不定的蝙蝠参与战斗。",
	],
	"stw":[
		"被动技能：",
		"毒灵加护：玩家处于【中毒】状态时，狮驼王会持续恢复生命。",
		"主动技能：",
		"1.傀儡毒雾：短暂施法后，在前方大范围内释放毒雾，玩家进入其中会受到伤害并被施加【中毒】，可被打断。",
		"2.移山岩爆：短暂引导后，在身旁召唤巨石，引爆三次，被命中的玩家会受到伤害并被施加【眩晕】。",
	],
	"pmw":[
		"被动技能：",
		"1.火灵加护：玩家处于【灼烧】状态时，鹏魔王会持续恢复生命。",
		"2.飞行加护：鹏魔王每过一段时间会从【地面】和【空中】状态之间切换。",
		"3.涅槃重生：鹏魔王生命低于20%会化为凤凰蛋，7秒内未击杀将会满血复活并提升自身实力。",
		"主动技能：",
		"地面：",
		"火焰飞弹：从上方向下飞出三颗火焰飞弹，造成伤害并施加【灼烧】。",
		"飞行：",
		"1.火焰飞弹：从上方向下飞出三颗火焰飞弹，造成伤害并施加【灼烧】。",
		"2.化为火鸟从上至下俯冲四次，每次都会造成伤害并施加【灼烧】。",
	],
	"gcx":[
		"主动技能：",
		"1.冰玄波：长袖一挥，释放冰玄波，造成伤害并施加【冰冻】。",
		"2.水龙卷：快速旋转，引发水龙卷并向前移动，造成伤害，结束后会被施加【眩晕】一段时间。",
	],
	"jmw":[
		"被动技能：",
		"绝对防御：玩家与蛟魔王面朝方向相同时，造成的伤害全额转化为对其的治疗效果。",
		"主动技能：",
		"1.覆海啸：怒吼，释放覆海啸，造成伤害并施加【眩晕】。",
		"2.堕天神针：指向天空，短暂延迟后从天空斜向下落下多根神针，造成伤害并施加【减速】。",
	],
	"smw":[
		"鲨魔王技能：",
		"被动技能：",
		"嗜血：鲨魔王低于70%生命后，会释放嗜血狂鲨参与战斗，并且部分攻击附带生命回复效果。",
		"主动技能：",
		"1.水泡炸弹：在玩家位置召唤一颗水泡炸弹，短暂延迟后爆炸，造成大量伤害并施加【眩晕】。",
		"2.嗜血鲨鱼波：在身旁释放嗜血鲨鱼波，造成伤害，然后从身旁两侧冲出鲨鱼，造成伤害并施加【流血】。",
		"主动技能：",
		"嗜血狂鲨技能：",
		"1.鲨鱼破：快速抖动身体，然后爆裂，造成伤害，之后在玩家脚下召唤鲨鱼龙卷。",
		"2.嗜血突袭，快速向前冲刺，并多次撕咬。",
	],
	"nmw1":[
		"主动技能：",
		"1.蛮牛冲撞：向两侧快速冲撞，并在沿途释放地狱火住。",
	],
	"nmw2":[
		"主动技能：",
		"1.蛮牛冲撞：化为青牛形态，快速冲撞，造成伤害并施加【眩晕】。",
		"2.熔岩机甲：化为熔岩机甲锤击地面，对小范围内的敌人造成伤害。",
		"3.万魂煞：释放邪恶力量，造成伤害，若引导成功，则快速回复多次生命，并且每次都会提升自身所有技能的伤害。",
	],
	"nmw3":[
		"主动技能：",
		"1.地狱魔爪：牛魔王的两只手会不断的追击玩家并砸向地面，造成伤害。",
		"2.地狱火柱：牛魔王会不断地召唤地狱火柱，或随机，或规律，并施加【灼烧】。",
	],
	"lw":[
		"21级转为高级龙王，各项属性得到提升：",
		"主动技能：",
		"1.千年冰雪：短暂延迟后在自身位置召唤冰雪，对命中玩家造成伤害并施加【冰冻】，高级转为玩家位置（抬手瞬间）。",
		"2.千年寒冰：短暂延迟后向两侧释放冰刺，造成伤害。高级还会施加【流血】。",
		"3.护体神龙：短暂延迟后在玩家位置召唤冰龙，造成伤害并击飞玩家。",
	],
	"hhe":[
		"主动技能：",
		"1.螺旋火尖枪：掷出火尖枪，对玩家造成伤害。",
		"2.三昧真火：向前方释放三昧真火造成伤害并施加【灼烧】。",
		"3.天光火石：短暂延迟后召唤天光火石砸向地面，造成伤害并施加【眩晕】。",
	],
	"syr":[
		"主动技能：",
		"1.割裂：挥舞利爪，造成伤害并施加【流血】。",
		"2.炼狱：丢出火棍，造成伤害并施加【灼烧】。",
	],
	"hbwc":[
		"被动技能：",
		"回魂：黑白无常未被同时击杀，则会在一段时间后满血复活。",
		"主动技能：",
		"1.痛苦：刺出痛苦雷电，造成伤害并施加【减速】。",
		"2.噩梦：释放噩梦魔球，造成伤害并施加【中毒】。",
	],
	"klw":[
		"主动技能：",
		"1.飞龙：从随机位置召唤飞龙，造成伤害并施加【缚地】。",
		"2.妖风：从右侧至左刮起两道妖风，造成伤害并施加【沉默】。",
	],
	"qgw":[
		"被动技能：",
		"玩家的主动回复效果会同样的成倍给秦广王回复生命。",
		"主动技能：",
		"1.追踪毒弹：释放追踪毒弹，触碰到玩家或一段时间后会爆裂，原地留下毒雾，施加【中毒】。",
		"2.傀儡娃娃：召唤数量不定的傀儡娃娃，靠近玩家会坠落并施加【中毒】，傀儡娃娃每过一段时间也会释放追踪毒弹。",
	],
	"pg":[
		"主动技能：",
		"1.神行：为自身添加【神行】一段时间内闪避和移动速度大幅提升。",
		"2.符咒：燃烧符咒并释放，造成伤害并施加【灼烧】。",
		"3.末日审判：每过一段时间会熄灭一盏灯并扣除玩家部分生命，最后秒杀。",
	],
	"ylw":[
		"被动技能：",
		"阎罗王的攻击命中玩家后会减少所有技能的CD。",
		"主动技能：",
		"1.鬼王剑气：多次斩击目标。",
		"2.赐死剑气：隐身，然后瞬移至玩家位置，刺出强力一击，施加【眩晕】并恢复大量生命。",
		"3.三道鬼门：生命降低到一定阶段会召唤鬼门，分别会：召唤怪物，回复场上怪物生命（满血则添加护盾），给玩家持续扣血并施加随机负面。",
	],
	"sdw":[
		"被动技能：",
		"宋帝王的能力会随着被鬼鱼撕咬的次数增加而变强。",
		"主动技能：",
		"1.致命黑烟：短暂延迟后在玩家位置召唤数道黑烟，造成伤害并施加【沉默】。",
		"2.夺命飞羽：短暂延迟后向前方释放多道飞羽，造成伤害并施加【缚地】。",
	],
	"yc":[
		"被动技能：",
		"夜叉生命低于70%会隐身，并且吸血能力和移动速度大幅提升。",
		"主动技能：",
		"腐蚀之咬：撕咬玩家并吸血。",
	],
	"mp":[
		"被动技能：",
		"生命低于一定阶段会进入梦境，持续回复生命并召唤Boss参与战斗。",
		"主动技能：",
		"1.幻境法球：随机释放法球追踪玩家造成伤害添加【冰冻】或【灼烧】。"
		,"2.能量流失：施加【能量流失】，玩家移动的越快，损失生命和魔法越快。"
	],
	"xt":[
		"主动技能：",
		"魔怨狂乱：向前方挥出多次拳击。"
		,"1.八方俱灭：飞向空中，然后砸向地面，造成伤害并施加【眩晕】。"
		,"2.吞噬：将玩家吸引至自身附近。"
	],
	"zsxt":[
		"主动技能：",
		"1.魔怨狂乱：向前方击砍数次，然后向前冲刺。"
		,"2.十方俱灭：将劈天斧和风神盾掷向空中，然后砸向地面，对大范围内的玩家造成伤害，同时施加【眩晕】。"
		,"3.吞噬：将玩家吸引至自身附近并施加【减速】。"
	],
	"bgj":[
		"被动技能：",
		"重生：白骨精可以复活两次，每次都会提高能力并改变形态。",
		"主动技能：",
		"1.夺命之吻：对面朝白骨精的玩家施加【封印】。"
		,"2.夺命连环刺：扎向地面，引发多道骨刺，造成伤害并施加【流血】，会随着复活次数而增加范围。"
	],
	"cjw":[
		"被动技能：",
		"水蛭再生：死亡时，根据场上存活的水蛭数量复活自身，自身攻击附带生命回复效果。",
		"主动技能：",
		"1.万江流：两种形态：1：立即向前方激起水柱，2：短暂延迟后全屏召唤水柱。"
		,"2.召唤水蛭：楚江王召唤水蛭，水蛭会吸附玩家，造成伤害并为楚江王治疗。"
		,"3.霸王连斩：快速连砍两次，造成流血。"
	],
	"zlw1":[
		"被动技能：",
		"随着生命降低，技能效果和释放频率将得到提升。",
		"主动技能：",
		"1.夺命飞轮：快速向玩家掷出多次飞轮，之后喷出能量柱，造成伤害。"
		,"2.魔轮：释放追踪魔轮，根据形态不同施加不同的负面状态。"
	],
	"zlw2":[
		"主动技能：",
		"1.转轮激光：释放全屏激光，造成伤害。"
		,"2.地狱轮海：短暂延迟后召唤轮海并向两侧释放巨型转轮，造成伤害并施加【眩晕】。"
		,"3.魔轮：掷出魔轮向玩家飞去并停留在原地，全部释放后将会收回。"
	],
	"zlw3":[
		"主动技能：",
		"1.转轮激光：释放激光，造成伤害（根据生命降低而逐渐增多）。"
		,"2.魔轮：掷出魔轮向地面飞去并停留在原地，全部释放后将会收回，释放数量与剩余生命相关，并且每次释放都会改变已释放魔轮的位置。"
	],
	"xtq":[
		"主动技能：",
		"1.回复自身和二郎神的生命，并提升能力。"
		,"2.短暂延迟后冲出三道狼影。"
		,"3.死亡后化身邪哮天犬，属性和能力大幅提升。"
	],
	"qly":[
		"被动技能：",
		"自身在场时，顺风耳双抗大幅提升。",
		"主动技能：",
		"蓄力朝天射出飞箭，之后从上方斜向下坠下巨型飞箭，造成伤害并施加【减速】。"
	],
	"sfe":[
		"主动技能：",
		"将玩家吸引至自身附近，若引导成功，则还会给千里眼回复巨额生命并提升其所有技能伤害。"
	],
	"jls":[
		"被动技能：",
		"巨灵神可以复活两次，每次复活都会提升自身实力并增大体型。",
		"主动技能：",
		"1.快速旋转冲向前方，造成伤害并施加【减速】。",
		"2.高高跃起然后砸向地面，造成伤害并施加【眩晕】。"
	],
	"mhwtf":[
		"主动技能：",
		"快速旋转冲向前方，造成伤害并施加【眩晕】。",
	],
	"zztw":[
		"被动技能：",
		"增长天王的所有攻击都有概率施加【冰冻】。",
		"主动技能：",
		"1.在身边召唤多把冰剑快速旋转，之后随机飞向一侧。",
		"2.短暂延迟后在大范围内持续落下冰箭。",
		"3.飞向空中，然后在身旁不断召唤冰剑飞向目标。",
	],
	"gmtw":[
		"主动技能：",
		"1.丢出长枪，然后瞬移至玩家位置并挑起目标。",
		"2.飞向空中，然后从两侧引发火焰，造成伤害并施加【灼烧】。",
		"3.在前方大范围内召唤火牛，造成伤害并施加【眩晕】。",
	],
	"dwtw":[
		"被动技能：",
		"多闻天王命中玩家一定次数后会获得大量护盾，护盾未击破则会转而回复自身生命。",
		"主动技能：",
		"1.将玩家吸引至自身附近。",
		"2.短暂延迟后召唤天雷，对横向范围内的目标造成伤害。",
		"3.飞向空中，然后在身旁召唤雷电造成伤害并施加【中毒】。",
	],
	"zzz":[
		"被动技能：",
		"朱子真每过一段时间获得一个护盾，护盾规定时间内未被击破将会爆炸，造成等额伤害并回复自身等额生命。",
		"主动技能：",
		"1.践踏地面，引发地震波向两侧不断扩散，会施加【眩晕】。",
		"2.将玩家吸引至自身附近并造成伤害。",
	],
	"yh":[
		"被动技能：",
		"袁洪的落雷罚会随着玩家生命的降低而不断提升伤害。生命低于65%将会召唤分身。",
		"主动技能：",
		"落雷罚，跃向空中，然后砸向地面，朝玩家方向释放多道雷霆附加【减速】。",
		"缩成一团，然后向前冲刺，附加【眩晕】。",
	],
	"els":[
		"主动技能：",
		"1.原地消失，然后瞬移至玩家位置劈出一击，附加【眩晕】。",
		"2.召唤三眼激光扫射前方，造成伤害。",
		"3.召唤三眼封印，玩家面朝二郎神或者被击中都会被施加【三眼封印】（无法回复生命）。",
	],
	"txs":[
		"主动技能：",
		"1.钻入地面，一段时间后破土而出，分别会造成伤害。",
		"2.朝目标冲刺，会施加【眩晕】。",
	],
	"lzz":[
		"主动技能：",
		"1.召唤黑洞，每过一段时间将玩家吸引至附加，造成伤害并施加【减速】。",
		"2.闪烁至玩家位置进行多次撕咬。",
		"3.在玩家附近召唤多道雷电，施加【眩晕】。",
	],
	"nz":[
		"主动技能：",
		"1.朝玩家掷出乾坤圈，乾坤圈会不断在该路径移动，造成伤害并施加【减速】。",
		"2.释放风火轮，施加【灼烧】。",
		"3.召唤红莲护体，期间受到的所有伤害均会转为对其的治疗效果。",
	],
	"tttw":[
		"主动技能：",
		"1.丢出玲珑塔，一段时间后从玩家头顶坠落，造成伤害并施加【眩晕】（无法被清除）。",
		"2.推出玲珑塔幻影，命中玩家将会进行多次斩击。",
		"3.在身旁不断召唤旋风并施加【减速】。",
	],
	"yjdw":[
		"主动技能：",
		"1.银角大王唤出自身的邪恶力量，为自身回复多次生命，命中玩家还会施加【恐惧】。",
		"2.短暂延迟后飞出多道莲花印，造成伤害并施加【缚地】。",
		"3.召唤护体圈，被击中则会被施加【定身】。",
	],
	"jjdw":[
		"主动技能：",
		"1.冲向空中，并从玩家头顶落下，造成巨额伤害。",
		"2.瞬移至玩家附近，并劈砍三刀，共持续三次。",
		"3.牵引面朝金角大王的目标至身边，被击中还会施加【眩晕】（高级负面）。",
	],
	"qnj":[
		"主动技能：",
		"1.朝玩家掷出飞斧，被击中则会被【减速】，然后停留在原地，青牛精触碰到飞斧会立刻重置本技能CD并回复5%最大生命。",
		"2.不断地向玩家发起冲锋，被击中则会被施加【眩晕】。",
	],
	"tbjx":[
		"被动技能：",
		"每过一小段时间，太白金星都会瞬移至玩家附近。",
		"主动技能：",
		"1.指出一箭施加【定身】。",
		"2.召唤天星从天空坠落。",
	],
	"tslj":[
		"被动技能：",
		"天上老君不会释放普通攻击，并且被击中后会向前闪避，无法被连击。",
		"主动技能：",
		"1.召唤多道炼丹炉从天而降，造成伤害并施加【灼烧】。",
		"2.召唤金刚琢不断朝玩家飞去，若被释放的法器核心击中，则会被施加【眩晕】。",
		"3.召唤护体圈，被击中则会被施加【定身】。",
	],
	"mtj":[
		"主动技能：",
		"1.召唤旋风朝前方飞去，造成伤害并施加【沉默】。",
		"2.召唤旋风从自身附近飞去，造成伤害并施加【沉默】。",
	],
	"cgtw":[
		"主动技能：",
		"1.召唤旋风持国傀儡，被持国傀儡击中则会被施加【眩晕】。",
		"2.在玩家头顶召唤三颗火石，被击中则会被【眩晕】，之后在相对应的地面上产生尖刺。",
		"3.持国天王弹奏出音波，被击中则会被施加【沉默】。",
	],
	"fyj":[
		"主动技能：",
		"1.快速向前冲刺。",
		"2.化作剑气，进行数次斩击。",
	],
	"wll":[
		"主动技能：",
		"1.释放火焰朝玩家方向飞去。",
		"2.自身发光，治疗场上所有怪物单位，若生命已满，则转为添加等量护盾。",
	],
	"yzx":[
		"被动技能：",
		"焰中仙会召唤【飞烟剑】【五龙轮】助战，任意法宝存在时，自身受伤减少50%，自身吸血提高至1000%。",
		"主动技能：",
		"1.飞向空中，朝玩家位置释放多条火龙追击玩家，施加【减速】（高级负面）。",
		"2.消失不见，之后从天而降多颗陨石飞向玩家被命中的玩家会被施加【灼烧】（高级负面），释放结束后瞬移至玩家位置。",
		"3.召唤黑洞，将面朝焰中仙的玩家吸引至自身位置，并施加【眩晕】（高级负面）。",
		"4.瞬移三次到玩家位置进行多次斩击。",
		"5.在自身周围召唤火龙烈焰造成伤害施加【破甲】（高级负面）。",
	],
	"nmw4":[
		"被动技能：",
		"1.万魂煞：每过10秒召唤黑魂环绕自身，对玩家造成伤害。",
		"2.灵魂剥夺：牛魔王的攻击不会增加角色保护进度，对玩家造成伤害的同时，会剥夺一部分玩家灵魂，造成额外伤害的同时，灵魂会飞向牛魔王，并转为对其的治疗效果（根据牛魔王已损失生命逐渐提升）。",
		"3.格挡：受到攻击时，10%概率格挡（瞬时进入无法被攻击状态）并反击。",
		"4.魂煞追杀：若玩家与牛魔王之间的距离大于牛魔王攻击距离，牛魔王的普通攻击会释放恶魂追击玩家。",

		"主动技能：",
		"1.朝天空怒吼，之后不断地从天而降陨石（体积随牛魔王生命降低而增大），对命中的玩家造成伤害并施加【穿甲】（高级负面）。",
		"2.俯下身体，在自身周围召唤地狱烈焰，短暂延迟后喷发，造成伤害并施加【灼烧】（高级负面）。",
		"3.巨斧砸击地面，将玩家吸引至自身位置，召唤蛮牛从两侧向中间冲撞，造成伤害并施加【眩晕】（高级负面）。",
	],
	"zlw4":[
		"被动技能：",
		"攻击不会增加保护进度",
		"主动技能：",
		"1.向玩家掷出飞轮，停留在原地，之后不断扩大，最后冲向玩家，命中boss会为其回复10%生命。",
		"2.短暂引导后在自身附近大范围内召唤转轮激光，造成伤害并施加【穿甲】（高级负面）。",
		"3.飞向空中，环绕自身召唤转轮，短暂延迟后飞向玩家，造成伤害并施加【眩晕】（高级负面）。",
		"4.飞向空中，从自身位置向地面随机位置释放转轮10个，短暂延迟后悉数飞回至自身位置。",
	],
	"wxzw":[
		"被动技能：",
		"五行祖巫全程免疫负面状态和击退效果，拥有500%的全能吸血效果",
		"主动技能：",
		"1.金灵之力：向两侧劈砍，然后快速旋转巨斧，造成多次伤害。",
		"2.木灵之力：从双翼释放飞刺飞向玩家，造成伤害并施加【法力流失】，每秒扣除一定魔法（高级负面）。",
		"3.水灵之力：在玩家位置召唤漩涡，短暂延迟后喷涌出水柱，共三次，造成伤害并概率施加【冰冻】（高级负面）。",
		"4.火灵之力：召唤火焰陨石从天而降飞向玩家，造成伤害并施加【灼烧】（高级负面）。",
		"5.土灵之力：在玩家位置伸出土灵鬼手，被抓住会受到伤害并施加【定身】（高级负面）。",
	],
	"hy":[
		"被动技能：",
		"每过2s恢复2%最大生命值。",
		"主动技能：",
		"1.向斜45°天空射出飞箭，短暂延迟后从天而降向玩家位置落下多道箭雨并施加【减速】（高级负面）。",
		"2.短暂引导后射出强力一箭，对触碰到的玩家造成真实伤害并施加【眩晕】（高级负面）。",
	],
	"ttzs":[
		"被动技能：",
		"死亡后可以复活，并且提升自身伤害和部分属性，并提升掉宝率。",
		"主动技能：",
		"1.天庭战神开始积蓄力量，引导完毕后恢复一定量的生命并提高所有技能的伤害，若被打断则给玩家施加【灼烧】，灼烧伤害百分比随复活次数而不断提高（高级负面）。",
		"2.蓄力飞向空中，然后从身边幻化出飞剑依次飞向玩家伤害并施加【穿甲】（高级负面）。",
		"3.每过一段时间，天庭战神会在原地幻化留下一个残影并瞬移至玩家位置，玩家靠近残影时，残影会攻击玩家。",
	],
}
func RefreshInfo():
	
	if MonsterName != "":
		if MonsterSkillInfoList.has(MonsterName):
			for i in monster_info.get_children():
				if i != null:
					i.queue_free()
			for i in MonsterSkillInfoList[MonsterName]:
				if i == "主动技能：" or i == "被动技能：":
					Global.ADDFont_(monster_info,i,"res://Font/Aa梦里掏花对月饮_mianfeiziti.com.ttf",25,"FFFFFF",1,"FFFFFF")
				else:
					Global.ADDFont_(monster_info,i,"res://Font/华康宋体W3.ttc",15,"FFFFFF",1,"FFFFFF")

func _on_dxx_pressed() -> void:
	MonsterName = "dxx"


func _on_mhw_pressed() -> void:
	MonsterName = "mhw"


func _on_yrw_pressed() -> void:
	MonsterName = "yrw"


func _on_bfsx_pressed() -> void:
	MonsterName = "bfsx"


func _on_stw_pressed() -> void:
	MonsterName = "stw"


func _on_pmw_pressed() -> void:
	MonsterName = "pmw"


func _on_gcx_pressed() -> void:
	MonsterName = "gcx"


func _on_jmw_pressed() -> void:
	MonsterName = "jmw"


func _on_smw_pressed() -> void:
	MonsterName = "smw"


func _on_nmw_1_pressed() -> void:
	MonsterName = "nmw1"


func _on_nmw_2_pressed() -> void:
	MonsterName = "nmw2"


func _on_nmw_3_pressed() -> void:
	MonsterName = "nmw3"


func _on_close_pressed() -> void:
	queue_free()


func _on_lw_pressed() -> void:
	MonsterName = "lw"


func _on_hhe_pressed() -> void:
	MonsterName = "hhe"


func _on_syr_pressed() -> void:
	MonsterName = "syr"


func _on_hbwc_pressed() -> void:
	MonsterName = "hbwc"


func _on_bgj_pressed() -> void:
	MonsterName = "bgj"


func _on_klw_pressed() -> void:
	MonsterName = "klw"


func _on_qgw_pressed() -> void:
	MonsterName = "qgw"


func _on_pg_pressed() -> void:
	MonsterName = "pg"


func _on_ylw_pressed() -> void:
	MonsterName = "ylw"


func _on_sdw_pressed() -> void:
	MonsterName = "sdw"


func _on_yc_pressed() -> void:
	MonsterName = "yc"


func _on_xt_pressed() -> void:
	MonsterName = "xt"


func _on_mp_pressed() -> void:
	MonsterName = "mp"


func _on_zlw_1_pressed() -> void:
	MonsterName = "zlw1"


func _on_zlw_2_pressed() -> void:
	MonsterName = "zlw2"


func _on_zlw_3_pressed() -> void:
	MonsterName = "zlw3"


func _on_zsxt_pressed() -> void:
	MonsterName = "zsxt"


func _on_xtq_pressed() -> void:
	MonsterName = "xtq"


func _on_qly_pressed() -> void:
	MonsterName = "qly"


func _on_sfe_pressed() -> void:
	MonsterName = "sfe"


func _on_mhwtf_pressed() -> void:
	MonsterName = "mhwtf"


func _on_jls_pressed() -> void:
	MonsterName = "jls"


func _on_zztw_pressed() -> void:
	MonsterName = "zztw"


func _on_gmtw_pressed() -> void:
	MonsterName = "gmtw"


func _on_dwtw_pressed() -> void:
	MonsterName = "dwtw"


func _on_mtj_pressed() -> void:
	MonsterName = "mtj"


func _on_cgtw_pressed() -> void:
	MonsterName = "cgtw"


func _on_zzz_pressed() -> void:
	MonsterName = "zzz"


func _on_yh_pressed() -> void:
	MonsterName = "yh"


func _on_tslj_pressed() -> void:
	MonsterName = "tslj"


func _on_tbjx_pressed() -> void:
	MonsterName = "tbjx"


func _on_jjdw_pressed() -> void:
	MonsterName = "jjdw"


func _on_yjdw_pressed() -> void:
	MonsterName = "yjdw"


func _on_tttw_pressed() -> void:
	MonsterName = "tttw"


func _on_nz_pressed() -> void:
	MonsterName = "nz"


func _on_lzz_pressed() -> void:
	MonsterName = "lzz"


func _on_txs_pressed() -> void:
	MonsterName = "txs"


func _on_els_pressed() -> void:
	MonsterName = "els"


func _on_qnj_pressed() -> void:
	MonsterName = "qnj"


func _on_cjw_pressed() -> void:
	MonsterName = "cjw"


func _on_fyj_pressed() -> void:
	MonsterName = "fyj"


func _on_wll_pressed() -> void:
	MonsterName = "wll"


func _on_yzx_pressed() -> void:
	MonsterName = "yzx"


func _on_nmw_4_pressed() -> void:
	MonsterName = "nmw4"


func _on_zlw_4_pressed() -> void:
	MonsterName = "zlw4"


func _on_wxzw_pressed() -> void:
	MonsterName = "wxzw"


func _on_hy_pressed() -> void:
	MonsterName = "hy"


func _on_ttzs_pressed() -> void:
	MonsterName = "ttzs"
